"use client";
import dynamic from "next/dynamic";

const SocialShared = dynamic(() => import("@/components/SocialShared"), {
  ssr: false,
});
const Speaker = dynamic(() => import("@/components/Speaker"), { ssr: false });
const Background = dynamic(() => import("@/components/Background"), {
  ssr: false,
});

export default function Home() {
  return (
    <div className="flex min-h-screen flex-col items-center bg-[#222e4d] relative">
      <div className="hidden xmd:block">
        <SocialShared />
      </div>
      <Background />
      <Speaker />

      {/* <div className="relative p-6 md:p-12">
        <p>
          กิจกรรม "ลอยกระทงทั่วไทย สุขใจทุกภาคกับสนุก 2568" ("กิจกรรม")
          จัดขึ้นโดยบริษัท อิมเมจ ฟิวเจอร์ (ประเทศไทย) จำกัด ("บริษัทฯ")
          ซึ่งเป็นผู้ให้บริการเว็บไซต์และแอปพลิเคชัน Sanook
          ภายใต้กติกาและเงื่อนไขดังต่อไปนี้ ระยะเวลาของกิจกรรม: ตั้งแต่วันที่ 27
          ตุลาคม 2568 ถึงวันที่ 30 พฤศจิกายน 2568 วิธีการเข้าร่วมกิจกรรม:
          ในระหว่างระยะเวลาของกิจกรรม ผู้ใช้บริการสามารถเข้าร่วมกิจกรรม
          "ลอยกระทงกับ ล้านกระทงรักษ์โลกกับสนุก 2568"
          ผ่านเว็บไซต์และ/หรือแอปพลิเคชัน Sanook ("ผู้ร่วมกิจกรรม")
          โดยผู้ร่วมกิจกรรมสามารถสร้างและตกแต่งกระทงออนไลน์ พร้อมใส่ชื่อ รูปภาพ
          และคำอธิษฐานหรือข้อความใด ๆ (รวมเรียกว่า "เนื้อหา") และกด
          "ลอยกระทงกันเลย" เพื่อลอยกระทงออนไลน์
          โปรดทราบว่าเนื้อหาจะไม่สามารถยกเลิกหรือเปลี่ยนแปลงได้หลักจากกด
          "ลอยกระทงกันเลย" ทั้งนี้
          ผู้ร่วมกิจกรรมการสามารถเข้าร่วมกิจกรรมได้ไม่จำกัดจำนวน
          ตลอดระยะเวลาของกิจกรรม
          และผู้ร่วมกิจกรรมสามารถแชร์กิจกรรมและ/หรือเนื้อหาของผู้ร่วมกิจกรรมไปยังสื่อสังคมออนไลน์
          เว็บไซต์และ/หรีอแพลตฟอร์มออนไลน์อื่นที่ให้บริการโดยผู้ให้บริการภายนอก
          ("บริการของบุคคลภายนอก") ได้ เงื่อนไขการเข้าร่วมกิจกรรม
          การเข้าร่วมกิจกรรมนี้จะถือว่าผู้ร่วมกิจกรรมได้อ่าน
          เข้าใจและยอมรับข้อกำหนดและเงื่อนไขของกิจกรรมนี้ ตลอดจน
          ข้อกําหนดในการให้บริการและนโยบายการคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์และ/หรือแอปพลิเคชัน
          Sanook เป็นที่เรียบร้อยแล้ว
          ผู้ร่วมกิจกรรมตกลงและรับทราบว่าบรรดาเนื้อหาที่ผู้ร่วมกิจกรรมได้ให้ไว้โดยสมัครใจและนำเข้าสู่ระบบเพื่อร่วมกิจกรรมจะต้องไม่เป็นเนื้อหาที่ละเมิดสิทธิส่วนบุคคล
          สิทธิความเป็นส่วนตัว (ในที่นี้ให้หมายถึงข้อมูลใด ๆ
          ที่ทำให้สามารถระบุข้อมูลส่วนบุคคลของบุคคลอื่นได้ไม่ว่าโดยตรงหรือโดยอ้อม)
          หรือสิทธิทางทรัพย์สินปัญญาของบุคคลอื่น ตลอดจนไม่เป็นเนื้อหาลามกอนาจาร
          หมิ่นประมาท หยาบคาย ก่อให้เกิดความรุนแรง ไม่เหมาะสม
          รวมถึงขัดต่อกฎหมายหรือศีลธรรมอันดี ทั้งนี้ บริษัทฯ
          ขอสงวนสิทธิ์ใช้ดุลพินิจแต่เพียงผู้เดียวในการลบเนื้อหาที่บริษัทฯ
          พิจารณาแล้วเห็นว่าไม่เหมาะสม เป็นการละเมิด
          หรือขัดต่อกฎหมายหรือศีลธรรมอันดีโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
          ผู้ร่วมกิจกรรมรับทราบและยอมรับว่าเนื้อหาที่ผู้ร่วมกิจกรรมได้ให้ไว้โดยสมัครใจและนำเข้าสู่ระบบเพื่อร่วมกิจกรรมจะถูกเผยแพร่ต่อสาธารณะบนหน้ากิจกรรม
          "ลอยกระทงทั่วไทย สุขใจทุกภาคกับสนุก 2568"
          ผ่านเว็บไซต์และ/หรือแอปพลิเคชัน Sanook ตามวัตถุประสงค์ของกิจกรรมนี้
          และเนื้อหาดังกล่าวจะสามารถถูกเข้าถึงได้อย่างกว้างขวาง ในทันที
          และเป็นข้อมูลสาธารณะ ทั้งนี้
          ผู้ร่วมกิจกรรมตกลงและยินยอมต่อการเผยแพร่ซึ่งเนื้อหาของผู้ร่วมกิจกรรมที่กล่าวมาข้างต้นและยอมรับว่าได้พิจารณาอย่างรอบคอบในการให้เนื้อหาแก่บริษัทฯ
          ตามวัตถุประสงค์ของกิจกรรมนี้แล้ว
          ในกรณีที่ผู้ร่วมกิจกรรมแชร์กิจกรรมและ/หรือเนื้อหาของกิจกรรมไปยังบริการของบุคคลภายนอก
          ผู้ร่วมกิจกรรมรับทราบและยอมรับว่าผู้ร่วมกิจกรรมอาจตกอยู่ภายใต้ข้อกําหนดการใช้งานของบริการของบุคคลภายนอกซึ่งถูกควบคุมและดูแลโดยผู้ให้บริการภายนอกนั้น
          ผู้ร่วมกิจกรรมรับทราบและยอมรับว่าบริษัทฯ
          ไม่มีอำนาจควบคุมและไม่รับผิดชอบต่อบริการของบุคคลภายนอกและเนื้อหาบนบริการของบุคคลภายนอกนั้น
          หรือต่อความสูญเสียหรือความเสียหายใด ๆ
          ที่เกิดจากการเข้าถึงหรือใช้งานบริการของบุคคลภายนอกในทุกกรณี
          โปรดทราบว่าผู้ให้บริการแต่ละรายจะมีข้อกําหนดและเงื่อนไขการใช้งานบริการที่แตกต่างกัน
          บริษัทฯ
          แนะนำให้ผู้ร่วมกิจกรรมอ่านข้อกําหนดและเงื่อนไขการใช้งานของผู้ให้บริการภายนอกนั้นด้วย
          ผู้ร่วมกิจกรรมตกลงและรับทราบว่ากิจกรรมนี้ไม่ได้มุ่งการให้บริการแก่บุคคลที่ยังไม่บรรลุนิติภาวะเนื่องจากกิจกรรมนี้มีความจำเป็นต้องใช้วิจารณญาณในการใช้บริการ
          และกิจกรรมนี้มีวัตถุประสงค์เฉพาะสำหรับบุคคลที่บรรลุนิติภาวะตามกฎหมายแล้ว
          ดังนั้น หากท่านยังเป็นผู้เยาว์หรือบุคคลที่ยังไม่บรรลุนิติภาวะตามกฎหมาย
          โปรดหลีกเลี่ยงการเข้าร่วมกิจกรรมนี้
          เว้นแต่กรณีที่ได้รับอนุญาตและความยินยอมจากผู้ปกครองหรือผู้พิทักษ์ของท่านก่อนการเข้าร่วมกิจกรรมทั้งนี้
          ในการเข้าร่วมกิจกรรมนี้ ท่านยืนยันและรับรองว่าท่าน (ก)
          มีอำนาจโดยสมบูรณ์และมีคุณสมบัติตามกฎหมาย
          หรือได้รับอนุญาตโดยชอบให้ตกลงตามข้อกำหนดนี้ และ (ข)
          ไม่ถูกห้ามไม่ให้ใช้บริการหรือเข้าร่วมกิจกรรมนี้ภายใต้กฎหมายที่เกี่ยวข้อง
          เพื่อให้บรรลุวัตถุประสงค์ของกิจกรรมนี้ ผู้ร่วมกิจกรรมอนุญาตให้บริษัทฯ
          เก็บ รวบรวม ใช้ เปิดเผย
          และ/หรือประมวลผลข้อมูลส่วนบุคคลที่ให้ไว้เพื่อวัตถุประสงค์ที่เกี่ยวข้องกับกิจกรรมนี้
          (รวมถึงแต่ไม่จำกัดเพียง รูปภาพ ชื่อ-นามสกุล ชื่อเล่น/นามแฝง
          ไอพีแอดเดรส หรือข้อมูลใด ๆ ที่สามารถหรือทำให้สามารถระบุตัวตนได้)
          และผู้ร่วมกิจกรรมรับทราบข้อตกลงและเงื่อนไข ดังต่อไปนี้ บริษัทฯ จะเก็บ
          รวมรวม ใช้ เปิดเผย
          และ/หรือประมวลผลข้อมูลส่วนบุคคลของผู้ร่วมกิจกรรมตามนโยบายการคุ้มครองข้อมูลส่วนบุคคลของเว็บไซต์และ/หรือแอปพลิเคชัน
          Sanook และตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562
          (ที่อาจมีการแก้ไขเพิ่มเติมเป็นครั้งคราว) รวมถึงกฎหมายและกฎระเบียบอื่น
          ๆ ที่เกี่ยวข้อง ผู้ร่วมกิจกรรมรับทราบและตกลงว่า
          ในกรณีที่ผู้ร่วมกิจกรรมได้ให้และนำเข้าสู่ระบบซึ่งข้อมูลส่วนบุคคลของผู้อื่น
          ผู้ร่วมกิจกรรมรับรองและรับประกันว่าผู้ร่วมกิจกรรมได้แจ้งให้บุคคลนั้นทราบและได้รับความยินยอมจากบุคคลนั้นให้บริษัทฯ
          เก็บ รวบรวม ใช้ เปิดเผย
          และ/หรือประมวลผลข้อมูลส่วนบุคคลของบุคคลนั้นเพื่อวัตถุประสงค์ที่เกี่ยวข้องกับกิจกรรมนี้ได้
          นโยบายการคุ้มครองข้อมูลส่วนบุคคลนี้จะใช้บังคับเฉพาะสำหรับกิจกรรมและเนื้อหาที่เกิดขึ้นบนเว็บไซต์และ/หรือแอปพลิเคชัน
          Sanook ที่ควบคุมดูแลโดยบริษัทฯ เท่านั้น
          และไม่ใช้บังคับกับกิจกรรมหรือเนื้อหาที่ผู้ร่วมกิจกรรมแชร์ไปยังบริการของบุคคลภายนอก
          ในกรณีที่ผู้ร่วมกิจกรรมแชร์กิจกรรมและ/หรือเนื้อหาของกิจกรรมไปยังบริการของบุคคลภายนอก
          ผู้ร่วมกิจกรรมรับทราบและยอมรับว่าข้อมูลส่วนบุคคลในเนื้อหาอาจถูกเก็บ
          รวมรวม ใช้ เปิดเผย
          และ/หรือประมวลผลโดยผู้ให้บริการภายนอกนั้นและอยู่นอกเหนือการควบคุมดูแลของบริษัทฯ
          ในกรณีนี้
          โปรดอ่านและทำความเข้าใจนโยบายความเป็นส่วนตัวหรือข้อกำหนดและเงื่อนไขด้านการคุ้มครองข้อมูลส่วนบุคคลบนเว็บไซต์ของผู้ให้บริการภายนอกดังกล่าวอย่างรอบคอบ
          บริษัทฯ ไม่รับผิดชอบต่อความเสียหาย สูญเสีย และค่าใช้จ่ายใด ๆ
          ที่เกิดขึ้น ไม่ว่าทางตรงหรือทางอ้อม อันเกิดจากการเก็บ รวมรวม ใช้
          เปิดเผย และ/หรือประมวลผลข้อมูลส่วนบุคคลของผู้ให้บริการภายนอกนั้น
          หากมีข้อสงสัยหรือต้องการข้อมูลเพิ่มเติมเกี่ยวกับการเก็บ รวบรวม ใช้
          และประมวลผลข้อมูลส่วนบุคคลของบริษัทฯ กรุณาติดต่อ DPO@tencent.co.th
          โดยระบุชื่อกิจกรรมพร้อมรายละเอียดข้อสงสัยหรือข้อหาที่ครบถ้วน ทั้งนี้
          บริษัทฯ
          ขอสงวนสิทธิตอบข้อสงสัยหรือข้อหารือที่ได้ระบุรายละเอียดมาโดยครบถ้วนเท่านั้น
          ผู้ร่วมกิจกรรมตกลงรับผิดชอบต่อการใช้งาน
          การเข้าร่วมกิจกรรมและการส่งมอบหรือนำเข้าซึ่งเนื้อหาหรือข้อมูลใด ๆ
          สู่กิจกรรมและ/หรือระบบของตนแต่เพียงผู้เดียวและตกลงว่าบริษัทฯ
          จะไม่รับผิดต่อความเสียหาย สูญเสีย และค่าใช้จ่ายใด ๆ ที่เกิดขึ้น
          ไม่ว่าทางตรงหรือทางอ้อม อันเนื่องมาจากหรือเกี่ยวข้องกับการใช้งาน
          การเข้าร่วมกิจกรรมและการส่งมอบหรือนำเข้าซึ่งเนื้อหาหรือข้อมูลใด ๆ
          ของผู้ร่วมกิจกรรม กรณีรวมถึงแต่ไม่จํากัดเพียง
          ความเสียหายหรือสูญเสียที่เกิดจากการละเมิดข้อกําหนดและเงื่อนไขนี้
          การใช้งานที่ผิดปกติหรือการกระทำผิดทางคอมพิวเตอร์ของผู้ร่วมกิจกรรม
          หรือการกระทำใด ๆ ที่ละเมิดกฎหมายที่เกี่ยวข้องของผู้ร่วมกิจกรรม
          ผู้ร่วมกิจกรรมรับทราบว่าการเข้าถึงเว็บไซต์และ/หรือแอปพลิเคชัน Sanook
          และ/หรือระบบของกิจกรรมอาจถูกจำกัดหรือมีข้อบกพร่องอันเนื่องมาจากเหตุอันไม่อาจคาดหมาย
          เช่น การล้มเหลวของระบบเครือข่าย ปัญหาการส่งผ่านข้อมูล
          หรือการล้มเหลวของระบบคอมพิวเตอร์ บริษัทฯ ขอสงวนสิทธิ์ดำเนินการใด ๆ
          อันสมควร ซึ่งรวมถึงแต่ไม่จำกัดเพียง การลบและแก้ไขข้อผิดปกติ
          การระงับหรือการยกเลิกกิจกรรมเพื่อปกป้องสิทธิอันชอบธรรมและผลประโยชน์ของบริษัทฯ
          และผู้ร่วมกิจกรรมเข้าใจและยอมรับว่าบริษัทฯ
          ไม่ต้องรับผิดชอบต่อความเสียหายใด ๆ
          ที่เกิดขึ้นแก่ผู้ร่วมกิจกรรมและยอมรับการตัดสินและการดำเนินการของบริษัทฯ
          โดยไม่มีข้อโต้แย้งใด ๆ ทั้งสิ้น บริษัทฯ
          ขอสงวนสิทธิ์ในการยกเลิกหรือปรับเปลี่ยนเงื่อนไขของกิจกรรม
          ระยะเวลาของกิจกรรม วิธีการร่วมกิจกรรม หรือเงื่อนไขและข้อกำหนดใด ๆ
          ของกิจกรรมนี้ตามความเหมาะสมโดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า ทั้งนี้
          ผู้ร่วมกิจกรรมสามารถศึกษาข้อกำหนดและเงื่อนไขของกิจกรรมฉบับล่าสุดได้ที่
          [หน้ากิจกรรม] บริษัทฯ ขอสงวนสิทธิ์ไม่รับผิดชอบในความเสียหาย สูญเสีย
          หรือค่าใช้จ่ายใด ๆ
          ที่เกิดขึ้นหากมีการฝ่าฝืนข้อกำหนดและเงื่อนไขของกิจกรรมนี้
          กรณีมีข้อโต้แย้งหรือข้อพิพาทใด ๆ ที่เกิดขึ้นจากกิจกรรมนี้
          ให้ถือคำตัดสินของบริษัทฯ เป็นเด็ดขาดและที่สิ้นสุด
          หากมีข้อสงสัยหรือต้องการข้อมูลเพิ่มเติมเกี่ยวกับกิจกรรมนี้
          กรุณาติดต่ออีเมล์ marketing@tencent.co.th
        </p>
      </div> */}
    </div>
  );
}
